In [2]:
import pandas as pd

### Q1. List any five functions of the pandas library with execution.

#### 1. pd.DataFrame() : used to create a new dataframe

In [25]:
data = [[3,4,5,6,7],[3,0,9,8,7],[4,3,5,6,7]]
df = pd.DataFrame(data)
df

   0  1  2  3  4
0  3  4  5  6  7
1  3  0  9  8  7
2  4  3  5  6  7

#### 2. mean() : used to get mean all numeric values column

In [26]:
df.mean()

0    3.333333
1    2.333333
2    6.333333
3    6.666667
4    7.000000
dtype: float64

#### 3. pd.Series( ) create a pandas series

In [27]:
df = pd.Series([4,5,6,7,8,9])
type(df)

pandas.core.series.Series

#### 4. pd.read_csv() used to read a csv file in pandas

In [ ]:
df = pd.read_csv("data.csv")

#### 5.df.sum() used to sum all numeric data columns

In [29]:
df.sum()

39

#### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [2]:
A = pd.Series(["Ketu","Shivam","Anis","Megh","Riken","Sarthak"])
B = pd.Series([19,20,19,19,19,19])
C = pd.Series(["male","male","male","male","male","male"])
pd1 = pd.DataFrame({"A" : A,"B" : B, "C" : C})

In [3]:
pd1

         A   B     C
0     Ketu  19  male
1   Shivam  20  male
2     Anis  19  male
3     Megh  19  male
4    Riken  19  male
5  Sarthak  19  male

In [4]:
pd1_reindex = pd1.reindex(index = range(1,6,2))

In [5]:
pd1_reindex

         A   B     C
1   Shivam  20  male
3     Megh  19  male
5  Sarthak  19  male

#### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
#### For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [6]:
data = {"Values" : [10, 20, 30, 40, 50]}
df1 = pd.DataFrame(data)
df1

   Values
0      10
1      20
2      30
3      40
4      50

In [7]:
def three_sum() :
    first_three = df1.iloc[0:3]
    return first_three.sum()
print(three_sum())

Values    60
dtype: int64

#### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [8]:
Data = {"Text" : ["Panda","Lion","Tiger"]}
df2 = pd.DataFrame(Data)
df2

    Text
0  Panda
1   Lion
2  Tiger

In [17]:
df2["Word_Count"] = df2["Text"].str.len()
df2

    Text  Word_Count
0  Panda           5
1   Lion           4
2  Tiger           5

#### Q5. How are DataFrame.size() and DataFrame.shape() different?
##### DataFrame.size it is return number_row*number_column

In [19]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.size

8

##### DataFrame.shape it is return number_row,number_column

In [18]:
df = pd.DataFrame({'name':['ye','fee','gol','jho'],
                   'Age':[3,4,5,7]})
df.shape

(4, 2)

#### Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel("anything.excel")

#### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.
#### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [22]:
Data = {"Email_id" : ["Ketup3423@gmail.com","Meghpatel076@gmail.com","iamgood@inueron.in"]}
df = pd.DataFrame(Data)
df

                 Email_id
0     Ketup3423@gmail.com
1  Meghpatel076@gmail.com
2      iamgood@inueron.in

In [42]:
df[['username','company']] = df['Email_id'].str.split("@",expand=True)
df

                 Email_id                Username     company      username
0     Ketup3423@gmail.com     Ketup3423@gmail.com   gmail.com     Ketup3423
1  Meghpatel076@gmail.com  Meghpatel076@gmail.com   gmail.com  Meghpatel076
2      iamgood@inueron.in      iamgood@inueron.in  inueron.in       iamgood

##### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
##### For example, if df contains the following values:
##### A B C
##### 0 3 5 1
##### 1 8 2 7
##### 2 6 9 4
##### 3 2 3 5
##### 4 9 1 2

##### Your function should select the following rows:
##### A B C
##### 1 8 2 7
##### 4 9 1 2

##### The function should return a new DataFrame that contains only the selected rows.

In [43]:
data = {"A" : [3,8,6,2,9],
        "B" : [5,2,9,3,1],
        "C" : [1,7,4,5,2]
       }
df = pd.DataFrame(data)
df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [45]:
df2 = df[(df["A"]>5 ) & ( df["B"]<10 )]

In [47]:
df_final = pd.DataFrame(df2)

In [48]:
df_final

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

#### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [7]:
df3 = pd.DataFrame({"Values" : [3,4,5,7,9,10,12]})

In [8]:
df3

   Values
0       3
1       4
2       5
3       7
4       9
5      10
6      12

In [9]:
df3.describe()

          Values
count   7.000000
mean    7.142857
std     3.338092
min     3.000000
25%     4.500000
50%     7.000000
75%     9.500000
max    12.000000

In [10]:
df3.mean()

Values    7.142857
dtype: float64

In [12]:
df3.std()

Values    3.338092
dtype: float64

In [13]:
df3.median()

Values    7.0
dtype: float64

#### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'Moving Average' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [15]:
import numpy as np
df = pd.DataFrame(pd.date_range(start='2023-02-10' , end = '2023-02-26'), columns = ['Date'])
df['Sales'] = np.random.randint(100,1000,size=(17))
df[['Sales','Date']]

    Sales       Date
0     575 2023-02-10
1     529 2023-02-11
2     652 2023-02-12
3     137 2023-02-13
4     260 2023-02-14
5     881 2023-02-15
6     374 2023-02-16
7     374 2023-02-17
8     838 2023-02-18
9     275 2023-02-19
10    568 2023-02-20
11    654 2023-02-21
12    109 2023-02-22
13    113 2023-02-23
14    909 2023-02-24
15    439 2023-02-25
16    266 2023-02-26

In [16]:
df['Moving Average'] = df['Sales'].rolling(window=7).mean().round(2)
df

         Date  Sales  Moving Average
0  2023-02-10    575             NaN
1  2023-02-11    529             NaN
2  2023-02-12    652             NaN
3  2023-02-13    137             NaN
4  2023-02-14    260             NaN
5  2023-02-15    881             NaN
6  2023-02-16    374          486.86
7  2023-02-17    374          458.14
8  2023-02-18    838          502.29
9  2023-02-19    275          448.43
10 2023-02-20    568          510.00
11 2023-02-21    654          566.29
12 2023-02-22    109          456.00
13 2023-02-23    113          418.71
14 2023-02-24    909          495.14
15 2023-02-25    439          438.14
16 2023-02-26    266          436.86

##### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
##### For example, if df contains the following values:
##### Date
##### O 2023-01-01
##### 1 2023-01-02
##### 2 2023-01-03
##### 3 2023-01-04
##### 4 2023-01-05

##### Your function should create the following DataFrame:
##### Date Weekday
##### 0 2023-01-01 Sunday
##### 1 2023-01-02 Monday
##### 2 2023-01-03 Tuesday
##### 3 2023-01-04 Wednesday
##### 4 2023-01-05 Thursday

##### The function should return the modified DataFrame.

In [3]:
Date = pd.date_range(start = "2023-01-01",end = "2023-01-05")
df5 = pd.DataFrame({"Date" : Date})
df5

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [5]:
df5["Weekdays"] = df5["Date"].dt.day_name()
df5

        Date   Weekdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

##### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [17]:
data = pd.date_range(start ='2022-12-01', end='2023-02-28')
df6 = pd.DataFrame(data,columns=["Date"])
df6

         Date
0  2022-12-01
1  2022-12-02
2  2022-12-03
3  2022-12-04
4  2022-12-05
..        ...
85 2023-02-24
86 2023-02-25
87 2023-02-26
88 2023-02-27
89 2023-02-28

[90 rows x 1 columns]

In [20]:
df_dates = (df6["Date"] > '2023-01-01') & (df6["Date"] < '2023-01-31')

In [22]:
df6[df_dates]

         Date
32 2023-01-02
33 2023-01-03
34 2023-01-04
35 2023-01-05
36 2023-01-06
37 2023-01-07
38 2023-01-08
39 2023-01-09
40 2023-01-10
41 2023-01-11
42 2023-01-12
43 2023-01-13
44 2023-01-14
45 2023-01-15
46 2023-01-16
47 2023-01-17
48 2023-01-18
49 2023-01-19
50 2023-01-20
51 2023-01-21
52 2023-01-22
53 2023-01-23
54 2023-01-24
55 2023-01-25
56 2023-01-26
57 2023-01-27
58 2023-01-28
59 2023-01-29
60 2023-01-30

In [ ]:
##### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?
Pandas libraty